电脑/python/文本处理/pyparsing模块.html
<!DOCTYPE html>
<html>
<head>
<!-- 2016-03-11 五 21:16 -->
<meta  charset="utf-8">
<meta  name="viewport" content="width=device-width, initial-scale=1">
<title>pyparsing模块</title>
<meta  name="generator" content="Org-mode">
<meta  name="author" content="万泽(德山书生)">
<meta  name="description" content="制作者邮箱：a358003542@gmail.com"
>
</head>
<body>
<div id="content">
<header>
<h1 class="title">pyparsing模块</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. 简介</a></li>
<li><a href="#orgheadline2">2. 空格</a></li>
<li><a href="#orgheadline3">3. <code>*</code> 有重复的含义</a></li>
<li><a href="#orgheadline4">4. srange函数</a></li>
<li><a href="#orgheadline5">5. Word类</a></li>
<li><a href="#orgheadline6">6. 刷float的进阶</a></li>
<li><a href="#orgheadline7">7. 刷化学分子式</a></li>
<li><a href="#orgheadline8">8. 刷wikipedia的infobox</a></li>
</ul>
</div>
</nav>


<div class="outline-2">
<h2 id="orgheadline1">简介</h2>
<div class="outline-text-2" id="text-1">
<p>
pyparsing模块是一个不错的超越re模块之上，用BNF思维来思考文本处理的模块，借助pyparsing模块，我们可以写出很强大的text parser。
</p>

<p>
其最简单的例子如下所示:
</p>
<div class="highlight"><pre><span></span><span class="kn">from</span> <span class="nn">pyparsing</span> <span class="kn">import</span> <span class="n">Word</span><span class="p">,</span> <span class="n">alphas</span>

<span class="c1"># define grammar</span>
<span class="n">greet</span> <span class="o">=</span> <span class="n">Word</span><span class="p">(</span> <span class="n">alphas</span> <span class="p">)</span> <span class="o">+</span> <span class="s2">&quot;,&quot;</span> <span class="o">+</span> <span class="n">Word</span><span class="p">(</span> <span class="n">alphas</span> <span class="p">)</span> <span class="o">+</span> <span class="s2">&quot;!&quot;</span>

<span class="c1"># input string</span>
<span class="n">hello</span> <span class="o">=</span> <span class="s2">&quot;Hello, World!&quot;</span>

<span class="c1"># parse input string</span>
<span class="k">print</span><span class="p">(</span><span class="n">hello</span><span class="p">,</span> <span class="s2">&quot;-&gt;&quot;</span><span class="p">,</span> <span class="n">greet</span><span class="o">.</span><span class="n">parseString</span><span class="p">(</span> <span class="n">hello</span> <span class="p">))</span>
</pre></div>

<p>
首先我们需要定义BNF text parser 模板，然后调用其 <code>parseString</code> 方法来具体进行parse操作。如果使用parseString而输入字符串并不复合规则，则会出错。我似乎更喜欢 <code>scanString</code> 方法，其并不出错，然后返回的结果是一个生成器对象，如果展开则如下所示:
</p>
<pre>
test: Hello, World! from python -&gt; [((['Hello', ',', 'World', '!'], {}), 6, 19)]
</pre>
<p>
其第一个是parse match的部分，然后第二个值是命中的start，第三个值是命中end的索引值。
</p>
</div>
</div>



<div class="outline-2">
<h2 id="orgheadline2">空格</h2>
<div class="outline-text-2" id="text-2">
<p>
pyparsing默认是忽略空格的，
</p>

<p>
加入我们要匹配 <code>3.1415926</code> 这样的float，若是:
</p>
<pre>
real = Word(nums) + '.' + Word(nums)
</pre>

<p>
则 <code>3 . 14</code> 也会匹配进去，这可能是你想要的，也可能不是。如果要精确匹配一个浮点数不允许中间出现空格，则要使用 <code>Combine</code> :
</p>

<pre>
real = Combine( Word(nums) + '.' + Word(nums) )
</pre>

<p>
这里 <code>Combine</code> 的作用就是将多个匹配token连接为一个匹配字符串。
</p>
</div>
</div>

<div class="outline-2">
<h2 id="orgheadline3"><code>*</code> 有重复的含义</h2>
<div class="outline-text-2" id="text-3">
<pre>
expr*3 is equivalent to expr + expr + expr
expr*(2,3) is equivalent to expr + expr + Optional(expr)
expr*(n,None) or expr*(n,) is equivalent to expr*n + ZeroOrMore(expr) (read as "at least n instances of expr")
expr*(None,n) is equivalent to expr*(0,n) (read as "0 to n instances of expr")
expr*(None,None) is equivalent to ZeroOrMore(expr)
expr*(1,None) is equivalent to OneOrMore(expr)
</pre>
</div>
</div>

<div class="outline-2">
<h2 id="orgheadline4">srange函数</h2>
<div class="outline-text-2" id="text-4">
<pre>
&gt;&gt;&gt; srange(r"[a-z]")
'abcdefghijklmnopqrstuvwxyz'
</pre>

<p>
srange函数里面大体有点类似于正则表达式的那种，但不能当成正则表达式，就类似上面那么写个范围即是了。
</p>
</div>
</div>

<div class="outline-2">
<h2 id="orgheadline5">Word类</h2>
<div class="outline-text-2" id="text-5">
<p>
下面这个token paser的意思是开头 <code>字母加上_</code> ，然后该词后面可以是 <code>字母加数字加_</code> 。
</p>

<pre>
Word( alphas+"_", alphanums+"_" )
</pre>
<p>
Word类可以如上接受两个参数，其中第一个是必填参数，说明这个词的开头可选字符，然后第二个可选参数是用来说明这个词的body，也就是后面的可选字符。该类还可以接受如下可选项:
</p>

<dl class="org-dl">
<dt>min</dt><dd>最小字符长度</dd>
<dt>max</dt><dd>最大字符长度</dd>
<dt>exact</dt><dd>确切字符长度</dd>
</dl>
</div>
</div>

<div class="outline-2">
<h2 id="orgheadline6">刷float的进阶</h2>
<div class="outline-text-2" id="text-6">
<p>
之前写的:
</p>
<pre>
real = Combine( Word(nums) + '.' + Word(nums) )
</pre>
<p>
还是较为粗糙，下面是一个简单完善点了的刷float的token paser:
</p>
<pre>
cs_real = set(nums + '.+-')

pe_real = Combine(Optional(Word('+-')) +  Word(nums) + '.' + Word(nums) )
tp_real = WordStart(cs_real) + pe_real + WordEnd(cs_real)
</pre>

<p>
首先我们看到 <code>Optional(Word('+-'))</code> ，这样将可能有的正负号加进去了。然后当我们parse <code>x=-3.14</code> 的时候还是将其刷不进去，因为我们还没有很好的定义词头和词尾。一个不错的做法是将该词可能的charset加进来。如上所示，这样明确词头和词尾了，我们就可以顺利的将 <code>x=-3.14</code> 这种格式刷出float来了。
</p>
</div>
</div>

<div class="outline-2">
<h2 id="orgheadline7">刷化学分子式</h2>
<div class="outline-text-2" id="text-7">
<p>
这个借鉴了官方examples的 <code>chemicalFormulas.py</code> 。我们注意看每个parser element后面是可以参数的，这个参数就是具体parse得到的结果。然后Optional可以设置默认值。然后 <code>Group</code> 这里的用途就是对于 <code>ZeroOrMore</code> 或者 <code>OneOrMore</code> 这样的parser element enhancement 更好的关闭。
</p>
<pre>
cs_formula = set(alphanums)
pe_element = Regex("A[cglmrstu]|B[aehikr]?|C[adeflmorsu]?|D[bsy]|"
                "E[rsu]|F[emr]?|G[ade]|H[efgos]?|I[nr]?|Kr?|L[airu]|"
                "M[dgnot]|N[abdeiop]?|Os?|P[abdmortu]?|R[abefghnu]|"
                "S[bcegimnr]?|T[abcehilm]|U(u[bhopqst])?|V|W|Xe|Yb?|Z[nr]")

pe_elementnum = Group( pe_element("element") + Optional( Word( nums ), default="1" )("num"))
tp_formula = WordStart(cs_formula) + OneOrMore( pe_elementnum ) + WordEnd(cs_formula)
</pre>
</div>
</div>

<div class="outline-2">
<h2 id="orgheadline8">刷wikipedia的infobox</h2>
</div>
</div>
</body>
</html>
